
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПоказатьПредупреждение(, ПечатьРазрешена(ПараметрКоманды));
	
КонецПроцедуры

&НаСервере
Функция ПечатьРазрешена(СсылкаНаДокумент)
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, "Проведен") Тогда
		Возврат
			НСтр("ru = 'Печать всех проведенных документов разрешена.
			           |Для проверки выберите непроведенный документ.'")
	КонецЕсли;
	
	Если УправлениеДоступом.ЕстьРоль("_ДемоПечатьНепроведенныхДокументов", СсылкаНаДокумент) Тогда
		Возврат
			НСтр("ru = 'Печать этого непроведенного документа разрешена,
			           |поскольку документ доступен на чтение (с учетом RLS) и
			           |включена роль ""Демо: Печать непроведенных документов"".'");
	Иначе
		Возврат
			НСтр("ru = 'Печать этого непроведенного документа запрещена,
				       |поскольку либо документ не доступен на чтение (с учетом RLS),
				       |либо отключена роль ""Демо: Печать непроведенных документов"".'");
	КонецЕсли;
	
КонецФункции

