#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Групповое изменение объектов

// Возвращает список реквизитов, которые не разрешается редактировать
// с помощью обработки группового изменения объектов.
//
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Наименование");
	Результат.Добавить("Заголовок");
	Результат.Добавить("Вступление");
	Результат.Добавить("Заключение");
	Результат.Добавить("РедактированиеШаблонаЗавершено");
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли