////////////////////////////////////////////////////////////////////////////////
// Подсистема "Управление итогами и агрегатами".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Сдвиг границы рассчитанных итогов.
Процедура УстановкаПериодаРассчитанныхИтогов() Экспорт
	
	Если НЕ УправлениеИтогамиИАгрегатамиСлужебный.НадоСдвинутьГраницуИтогов() Тогда
		Возврат; // Период уже был установлен в сеансе другого пользователя.
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	УправлениеИтогамиИАгрегатамиСлужебный.УстановитьПериодРассчитанныхИтогов();
	
КонецПроцедуры

#КонецОбласти
