
Процедура ВыполнитьПроверкуГраницСобытия(СобытиеСсылка) Экспорт
	
	РеквизитыСобытия	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СобытиеСсылка, "Статус, Повторять, НачалоСобытия, ОкончаниеСобытия");
	НапоминанияСобытия	= ПланировщикДанные.ПолучитьДанныеНапоминаний(СобытиеСсылка);
	
	СдвигНапоминанийНачало	= 0;
	СдвигНапоминанийКонец	= 3 * ПланировщикКлиентСервер.МесяцВСекундах(31);
	ЕстьНапоминания			= (НапоминанияСобытия.Количество() > 0);
	Для Каждого СтрокаНапоминания Из НапоминанияСобытия Цикл
		СдвигНапоминанийНачало	= Макс(СдвигНапоминанийНачало, СтрокаНапоминания.ИнтервалСекунды);
		СдвигНапоминанийКонец	= Мин(СдвигНапоминанийКонец, СтрокаНапоминания.ИнтервалСекунды);
	КонецЦикла;
	
	НаборЗаписей = РегистрыСведений.ГраницыСобытийПланировщика.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Событие.Установить(СобытиеСсылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Если НЕ РеквизитыСобытия.Статус = Перечисления.СтатусыСобытийПланировщика.Отменено Тогда
		Если НЕ РеквизитыСобытия.Повторять Тогда
			НачалоПовторений	= НачалоДня(РеквизитыСобытия.НачалоСобытия);
			ОкончаниеПовторений	= НачалоДня(РеквизитыСобытия.ОкончаниеСобытия);
		Иначе 
			НачалоПовторений	= РеквизитыСобытия.ПовторНачало;
			ОкончаниеПовторений = ПланировщикДанные.РассчитатьКонецПериодаПовторений(РеквизитыСобытия.Ссылка);
		КонецЕсли;
		СдвигСНачалаДня = РеквизитыСобытия.НачалоСобытия - НачалоДня(РеквизитыСобытия.НачалоСобытия);
		
		ЗаписьРегистра = НаборЗаписей.Добавить();
		ЗаписьРегистра.Событие				= СобытиеСсылка;
		ЗаписьРегистра.НачалоПовторений		= НачалоПовторений;
		ЗаписьРегистра.ОкончаниеПовторений	= ОкончаниеПовторений;
		ЗаписьРегистра.НачалоНапоминаний	= ?(НЕ ЕстьНапоминания, Дата(1, 1, 1), НачалоПовторений + СдвигСНачалаДня - СдвигНапоминанийНачало);
		ЗаписьРегистра.ОкончаниеНапоминаний	= ?(НЕ ЕстьНапоминания, Дата(1, 1, 1), ОкончаниеПовторений + СдвигСНачалаДня - СдвигНапоминанийКонец);
	КонецЕсли;
	
	НаборЗаписей.Записать();
			
КонецПроцедуры