
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОтборПоВладельцу = Параметры.Отбор.Свойство("Владелец");
	Если ОтборПоВладельцу Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Владелец", Параметры.Отбор.Владелец, ВидСравненияКомпоновкиДанных.Равно, "", Истина);
		Элементы.Владелец.Видимость = Ложь;
	КонецЕсли;
	
	ОтборПоВидуСобытия = Параметры.Отбор.Свойство("Календарь");
	Если ОтборПоВидуСобытия Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Календарь", Параметры.Отбор.Календарь, ВидСравненияКомпоновкиДанных.Равно, "", Истина);
	КонецЕсли;
КонецПроцедуры
