#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_НастройкиОтправкиSMS", ПараметрыЗаписи, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОписаниеУслугиБилайнНажатие(Элемент)
	ПерейтиПоНавигационнойСсылке("http://b2b.beeline.ru/msk/sb/mobile/services/index.wbp?id=3a15308a-7b14-4f8e-acda-0841dd6c750e");
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеУслугиМТСНажатие(Элемент)
	ПерейтиПоНавигационнойСсылке("http://www.mtscommunicator.ru/service/");
КонецПроцедуры

#КонецОбласти
