#Область УправлениеФормой

&НаКлиентеНаСервереБезКонтекста 
Процедура УстановитьОформлениеПредставленияЦвета(Форма)
	
	Элементы	= Форма.Элементы;
	Объект		= Форма.Объект;
	
	Элементы.ЦветПредставление.ЦветФона		= Новый Цвет(Объект.ЦветФонаКрасный, Объект.ЦветФонаЗеленый, Объект.ЦветФонаСиний);
	Элементы.ЦветПредставление.ЦветТекста	= Новый Цвет(Объект.ЦветТекстаКрасный, Объект.ЦветТекстаЗеленый, Объект.ЦветТекстаСиний);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЦветФонаHexНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЦветФонаВыборЗавершение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийЦвет", Новый Цвет(Объект.ЦветФонаКрасный, Объект.ЦветФонаЗеленый, Объект.ЦветФонаСиний));
	
	ОткрытьФорму("Обработка.ДиалогВыбораЦвета.Форма",
		ПараметрыФормы,
		ЭтотОбъект,,,,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЦветТекстаHexПриИзменении(Элемент)
	Цвет = ПланировщикКлиентСервер.HexВЦвет(Объект.ЦветТекстаHex);
	Объект.ЦветТекстаКрасный	= Цвет.Красный;
	Объект.ЦветТекстаЗеленый	= Цвет.Зеленый;
	Объект.ЦветТекстаСиний		= Цвет.Синий;
	
	УстановитьОформлениеПредставленияЦвета(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИмя
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОформлениеПредставленияЦвета(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте 
Процедура ЦветФонаВыборЗавершение(Цвет, ДопПараметры) Экспорт
	Если НЕ ТипЗнч(Цвет) = Тип("Цвет") Тогда
		Возврат;
	КонецЕсли;
	
	ЦветHex = ПланировщикКлиентСервер.ЦветВHex(Цвет.Красный, Цвет.Зеленый, Цвет.Синий);
	
	Объект.ЦветФонаHex		= НРег(ЦветHex);
	Объект.ЦветФонаКрасный	= Цвет.Красный;
	Объект.ЦветФонаЗеленый	= Цвет.Зеленый;
	Объект.ЦветФонаСиний	= Цвет.Синий;
	
	УстановитьОформлениеПредставленияЦвета(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти
