Процедура ПроверитьНапоминанияПланировщика() Экспорт
	
	ОтключитьОбработчикОжидания("ПроверитьНапоминанияПланировщика");
	
	ВремяБлижайшего = Неопределено;
	
	ТекущийПользователь	= ПользователиКлиентСервер.ТекущийПользователь();
	
	ТаблицаОповещений	= НапоминанияПользователяКлиент.ПолучитьТекущиеОповещения(ВремяБлижайшего);
	ДанныеПланировщика	= ПланировщикДанныеВызовСервера.ПроверитьНаличиеОповещений(ТекущийПользователь, ВремяБлижайшего);
	
	Если ТипЗнч(ДанныеПланировщика) = Тип("Массив") Тогда
		Для Каждого СтруктураНапоминания Из ДанныеПланировщика Цикл
			НапоминанияПользователяКлиент.ОбновитьЗаписьВКэшеОповещений(СтруктураНапоминания);
		КонецЦикла;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ПроверитьНапоминанияПланировщика", 60, Истина);
	
КонецПроцедуры