#Область ПрограммныйИнтерфейс

// Вызывается перед установкой параметров для отборажения календаря
//
// Параметры:
//	ПараметрыНастроек - Тип: Структура
//		ТолькоПросмотр - Тип: Булево. Только просмотр календаря
//		ОтображатьВыходные - Тип: Булево (только для Fullcalendar)
//		Месяцы - Тип: Соответствие(Число, Структура)
//			Ключ - Тип: Число. Номер месяца в году (1-12)
//			Значение - Тип: Структура
//				Полн - Тип: Строка. Полное представление месяца
//				Сокр - Тип: Строка. Сокращенное представление месяца
//		ДниНедели - Тип: Соответствие(Число, Структура)
//			Ключ - Тип: Число. Номер дня в неделе (1-7)
//			Значение - Тип: Структура
//				Полн - Тип: Строка. Полное представление дня
//				Сокр - Тип: Строка. Сокращенное представление дня
//		ВесьДень - Тип: Строка. Представление заголовка "Весь день" (только для Fullcalendar)
//		МинВремяСобытия - Тип: Число. Минимальное время для создаваемого события
//		НачалоРабочегоДня - Тип: Число. Начало дня в календаре (0-24)
//		КонецРабочегоДня - Тип: Число. Конец дня в календаре (0-24)
//		НачальныйВид - Тип: Число. 1 - день, 2 - неделя, 3 - месяц
//
Процедура ПриУстановкеНастроекФормыПланировщика(ПараметрыНастроек) Экспорт
	
КонецПроцедуры

// Возвращает имя подсистемы чтения данных для планировщика
//
Функция ИмяПодсистемыДанных() Экспорт
	
	Возврат "СтандартныеПодсистемыПТБ.ПланировщикДанные";
	
КонецФункции

#КонецОбласти
