////////////////////////////////////////////////////////////////////////////////////////////////////
// Подсистема "Контактная информация"
// 
////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Разбирает представление контактной информации и возвращает строку XML со значениями полей
//
//  Параметры:
//      Текст        - Строка - XML
//      ОжидаемыйТип - СправочникСсылка.ВидыКонтакнойИнформации, ПеречислениеСсылка.ТипыКонтактнойИнформации - для контроля типов
//
//  Возвращаемое значение:
//      Строка - XML
//
Функция ПарсингКонтактнойИнформацииXML(Знач Текст, Знач ОжидаемыйВид) Экспорт
	Возврат КонтактнаяИнформацияСлужебный.ПарсингКонтактнойИнформацииXML(Текст, ОжидаемыйВид);
КонецФункции

//  Возвращает значение перечисления тип вида контактной информации
//
//  Параметры:
//      ВидИнформации - СправочникСсылка.ВидыКонтакнойИнформации, Структура - исходные данные
//
//  Возвращаемое значение:
//      ПеречислениеСсылка.ТипыКонтактнойИнфомарции - значение поля "Тип"
//
Функция ТипВидаКонтактнойИнформации(Знач ВидИнформации) Экспорт
	Возврат УправлениеКонтактнойИнформацией.ТипВидаКонтактнойИнформации(ВидИнформации);
КонецФункции

// Возвращает строку состава из значения контактной информации.
//
//  Параметры:
//      XMLДанные - Строка - XML данных контакной информации
//
//  Возвращаемое значение:
//      Строка - содержимое
//      Неопределено - если значение состава сложного типа
//
Функция СтрокаСоставаКонтактнойИнформации(Знач XMLДанные) Экспорт;
	Возврат КонтактнаяИнформацияXML.СтрокаСоставаКонтактнойИнформации(XMLДанные);
КонецФункции

// Преобразует все входящие форматы контактной информации в XML
//
Функция ПривестиКонтактнуюИнформациюXML(Знач Данные) Экспорт
	Возврат КонтактнаяИнформацияXML.ПривестиКонтактнуюИнформациюXML(Данные);
КонецФункции

// Возвращает список идентификаторов строк доступных для копирования в текущий адресов
// 
Функция ДоступныеДляКопированияАдреса(Знач ЗначенияПолейДляАнализа, Знач ВидАдреса) Экспорт
	
	Возврат УправлениеКонтактнойИнформацией.ДоступныеДляКопированияАдреса(ЗначенияПолейДляАнализа, ВидАдреса);
	
КонецФункции

// Возвращает найденную ссылку или создает новую страну мира и возвращает ссылку на нее
//
Функция СтранаМираПоДаннымКлассификатора(Знач КодСтраны) Экспорт
	Возврат Справочники.СтраныМира.СсылкаПоДаннымКлассификатора(
		Новый Структура("Код", КодСтраны)
	);
КонецФункции

// Заполняет коллекцию ссылками на найденные или созданные страны мира
//
Процедура КоллекцияСтранМираПоДаннымКлассификатора(Коллекция) Экспорт
	Для Каждого КлючЗначение Из Коллекция Цикл
		Коллекция[КлючЗначение.Ключ] = Справочники.СтраныМира.СсылкаПоДаннымКлассификатора(
			Новый Структура("Код", КлючЗначение.Значение.Код)
		);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
