////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен данными в модели сервиса".
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Для внутреннего использования
// 
Функция СинхронизацияССервисомДавноНеВыполнялась() Экспорт
	
	Возврат АвтономнаяРаботаСлужебный.СинхронизацияССервисомДавноНеВыполнялась();
	
КонецФункции

// Для внутреннего использования
// 
Функция ПараметрыФормыВыполненияОбменаДанными() Экспорт
	
	Возврат АвтономнаяРаботаСлужебный.ПараметрыФормыВыполненияОбменаДанными();
	
КонецФункции

#КонецОбласти
