#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Обработчик обновления информационной базы.
Процедура ПереместитьДанныеВНовыйРегистр() Экспорт
	
	ТипыВладельцев = УправлениеДоступомСлужебныйПовтИсп.Параметры().ВозможныеПраваДляНастройкиПравОбъектов.ТипыВладельцев;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипыВладельцев", ТипыВладельцев);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УдалитьГруппыЗначенийДоступа.ЗначениеДоступа КАК Объект,
	|	УдалитьГруппыЗначенийДоступа.ГруппаЗначенийДоступа КАК Родитель,
	|	УдалитьГруппыЗначенийДоступа.НаследоватьПраваРодителей КАК Наследовать
	|ИЗ
	|	РегистрСведений.УдалитьГруппыЗначенийДоступа КАК УдалитьГруппыЗначенийДоступа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|		ПО (УдалитьГруппыЗначенийДоступа.ЗначениеДоступа = УдалитьГруппыЗначенийДоступа.ГруппаЗначенийДоступа)
	|			И (УдалитьГруппыЗначенийДоступа.НаследоватьПраваРодителей = ЛОЖЬ)
	|			И (ТИПЗНАЧЕНИЯ(УдалитьГруппыЗначенийДоступа.ЗначениеДоступа) = ТИПЗНАЧЕНИЯ(ИдентификаторыОбъектовМетаданных.ЗначениеПустойСсылки))
	|			И (ИдентификаторыОбъектовМетаданных.ЗначениеПустойСсылки В (&ТипыВладельцев))";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		НаборЗаписей = РегистрыСведений.НаследованиеНастроекПравОбъектов.СоздатьНаборЗаписей();
		НаборЗаписей.Загрузить(РезультатЗапроса.Выгрузить());
		НаборЗаписей.Записать();
		
		НаборЗаписей = РегистрыСведений.УдалитьГруппыЗначенийДоступа.СоздатьНаборЗаписей();
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли