
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	СтруктураСертификата = Параметры.СтруктураСертификата;
	Отпечаток = Параметры.Отпечаток;
	
	УстановившийПодпись = Параметры.УстановившийПодпись;
	Комментарий  = Параметры.Комментарий;
	АдресПодписи = Параметры.АдресПодписи;
	ДатаПодписи  = Параметры.ДатаПодписи;
	
	Если ТипЗнч(Параметры.УстановившийПодпись) = Тип("Строка") Тогда
		УстановившийПодписьСтрока = Параметры.УстановившийПодпись;
		Элементы.УстановившийПодпись.Видимость = Ложь;
		Элементы.УстановившийПодписьСтрока.Видимость = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("АдресСертификата") Тогда
		АдресСертификата = Параметры.АдресСертификата;
	КонецЕсли;	
	
	КомуВыдан = СтруктураСертификата.КомуВыдан;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выгрузить(Команда)
	ЭлектроннаяПодписьКлиент.СохранитьПодпись(АдресПодписи);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСертификат(Команда)
	ЭлектроннаяПодписьКлиент.ОткрытьСертификатПоОтпечаткуИАдресу(Отпечаток, АдресСертификата);
КонецПроцедуры

#КонецОбласти
