////////////////////////////////////////////////////////////////////////////////
// Подсистема "Защита персональных данных"
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Осуществляет переход к форме подготовки согласие на обработку персональных данных, 
// используется как обработчик печати
//
// Параметры
//	ПараметрыПечати - структура параметров обработки команды печати,
//		должна содержать поля ОбъектыПечати и Форма
//
Функция ОткрытьФормуСогласиеНаОбработкуПерсональныхДанных(ПараметрыПечати) Экспорт
	
	ОткрытьФорму("Обработка.СогласиеНаОбработкуПерсональныхДанных.Форма", Новый Структура("Субъекты", ПараметрыПечати.ОбъектыПечати), ПараметрыПечати.Форма);
	
КонецФункции

#КонецОбласти
