
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Размещение заголовка.
	Если Не ПустаяСтрока(Параметры.Заголовок) Тогда
		Заголовок = Параметры.Заголовок;
		ШиринаЗаголовка = 1.3 * СтрДлина(Заголовок);
		Если ШиринаЗаголовка > 40 И ШиринаЗаголовка < 80 Тогда
			Ширина = ШиринаЗаголовка;
		КонецЕсли;
	КонецЕсли;
	
	// Размещение текста.
	Если СтрЧислоСтрок(Параметры.ТекстСообщения) < 15 Тогда
		// Можно вывести все строки в виде надписи.
		Элементы.ТекстСообщения.Заголовок = Параметры.ТекстСообщения;
		Элементы.МногострочныйТекстСообщения.Видимость = Ложь;
	Иначе
		// Многострочный режим.
		Элементы.ТекстСообщения.Видимость = Ложь;
		ТекстСообщения = Параметры.ТекстСообщения;
	КонецЕсли;
	
	// Сброс размеров и положения окна этой формы.
	КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти
