
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.РежимОткрытияИзФормы Тогда
		Элементы.Владелец.Видимость = Ложь;
	КонецЕсли;
	
	ПереключитьВидимостьСчетовВНедействующихБанках(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказыватьСчетаВНедействующихБанках(Команда)
	ПереключитьВидимостьСчетовВНедействующихБанках(Не Элементы.ФормаПоказыватьСчетаВНедействующихБанках.Пометка);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПереключитьВидимостьСчетовВНедействующихБанках(Видимость)
	
	Элементы.ФормаПоказыватьСчетаВНедействующихБанках.Пометка = Видимость;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "ДеятельностьБанкаПрекращена", Ложь, , , Не Видимость);
			
КонецПроцедуры

#КонецОбласти
