
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// Одиночный параметр
	НаборСсылок = Новый Массив;
	НаборСсылок.Добавить(ПараметрКоманды);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Владелец", ПараметрыВыполненияКоманды.Источник);
	ПараметрыОткрытия.Вставить("Уникальность", ПараметрыВыполненияКоманды.Уникальность);
	ПараметрыОткрытия.Вставить("Окно", ПараметрыВыполненияКоманды.Окно);
	ПараметрыОткрытия.Вставить("НавигационнаяСсылка", ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	СтандартныеПодсистемыКлиент.ПоказатьМестаИспользования(НаборСсылок, ПараметрыОткрытия);
КонецПроцедуры
