
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	СсылкаНаОбъект = Параметры.СсылкаНаОбъект;
	НомерВерсии = ВерсионированиеОбъектов.НомерПоследнейВерсии(СсылкаНаОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Если Модифицированность Тогда
		ДобавитьКомментарийКВерсии();
	КонецЕсли;
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ДобавитьКомментарийКВерсии()
	ВерсионированиеОбъектов.ДобавитьКомментарийКВерсии(СсылкаНаОбъект, НомерВерсии, Комментарий);
КонецПроцедуры

