#Область СлужебныеПроцедурыИФункции

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура УстановитьПрефиксИБИПерепрефиксоватьОбъектыСозданныеВЭтойИБ(Параметры, АдресВременногоХранилища) Экспорт
	
	ОбъектовОбработано = 0;
	ПерепрефиксацияОбъектов.УстановитьПрефиксИБИПерепрефиксоватьОбъектыСозданныеВЭтойИБ(
		Параметры.НовыйПрефикс,
		Параметры.СДаты,
		Параметры.ПредыдущийПрефиксИнформационнойБазы,
		ОбъектовОбработано);
	
	РезультатОбработкиДанных = Новый Структура("ОбъектовОбработано", ОбъектовОбработано);
	ПоместитьВоВременноеХранилище(РезультатОбработкиДанных, АдресВременногоХранилища);
	
КонецПроцедуры

Процедура УстановитьПрефиксИБИПерепрефиксоватьВсеОбъекты(Параметры, АдресВременногоХранилища) Экспорт
	
	ОбъектовОбработано = 0;
	ПерепрефиксацияОбъектов.УстановитьПрефиксИБИПерепрефиксоватьВсеОбъекты(
		Параметры.НовыйПрефикс,
		Параметры.СДаты,
		Параметры.ПредыдущийПрефиксИнформационнойБазы,
		ОбъектовОбработано);
	
	РезультатОбработкиДанных = Новый Структура("ОбъектовОбработано", ОбъектовОбработано);
	ПоместитьВоВременноеХранилище(РезультатОбработкиДанных, АдресВременногоХранилища);
	
КонецПроцедуры

Процедура УстановитьПрефиксИБИСоздатьОбъекты(Параметры, АдресВременногоХранилища) Экспорт
	
	ОбъектовОбработано = 0;
	ПерепрефиксацияОбъектов.УстановитьПрефиксИБИСоздатьОбъекты(
		Параметры.НовыйПрефикс,
		Параметры.СДаты,
		Параметры.ПредыдущийПрефиксИнформационнойБазы,
		ОбъектовОбработано);
	
	РезультатОбработкиДанных = Новый Структура("ОбъектовОбработано", ОбъектовОбработано);
	ПоместитьВоВременноеХранилище(РезультатОбработкиДанных, АдресВременногоХранилища);
	
КонецПроцедуры

Процедура УстановитьПрефиксИБИПерепрефиксоватьПоследниеОбъекты(Параметры, АдресВременногоХранилища) Экспорт
	
	ОбъектовОбработано = 0;
	ПерепрефиксацияОбъектов.УстановитьПрефиксИБИПерепрефиксоватьПоследниеОбъекты(
		Параметры.НовыйПрефикс,
		Параметры.СДаты,
		Параметры.ПредыдущийПрефиксИнформационнойБазы,
		ОбъектовОбработано);
	
	РезультатОбработкиДанных = Новый Структура("ОбъектовОбработано", ОбъектовОбработано);
	ПоместитьВоВременноеХранилище(РезультатОбработкиДанных, АдресВременногоХранилища);
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти


