////////////////////////////////////////////////////////////////////////////////
// Подсистема "Управление итогами и агрегатами"
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Обработчики служебных событий

// Доопределяет список предупреждений пользователю перед завершением работы системы.
//
// Параметры:
//  Предупреждения - Массив - в массив можно добавить элементы типа Структура,
//                            свойства которой см. в СтандартныеПодсистемыКлиент.ПредупреждениеПриЗавершениеРаботы.
//
Процедура ПриПолученииСпискаПредупрежденийЗавершенияРаботы(Предупреждения) Экспорт
	
	Параметры = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗавершении();
	Если Параметры.Свойство("УправлениеИтогамиИАгрегатами") И Параметры.УправлениеИтогамиИАгрегатами.СдвинутьГраницуИтогов Тогда
		
		ПараметрыПредупреждения = СтандартныеПодсистемыКлиент.ПредупреждениеПриЗавершениеРаботы();
		ПараметрыПредупреждения.ТекстФлажка = НСтр("ru = 'Ускорить проведение документов и формирование отчетов
			|(обязательная ежемесячная процедура, может занять некоторое время)'");
		ПараметрыПредупреждения.Приоритет = 60;
		ДействиеПриУстановленномФлажке = ПараметрыПредупреждения.ДействиеПриУстановленномФлажке;
		ДействиеПриУстановленномФлажке.Форма = "Обработка.СдвигГраницыИтоговПриЗавершенииРаботы.Форма";
		ДействиеПриУстановленномФлажке.ПараметрыФормы = Новый Структура("ОткрытаПоСценарию", Истина);
		Предупреждения.Добавить(ПараметрыПредупреждения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
