////////////////////////////////////////////////////////////////////////////////
// Подсистема "Адресный классификатор".
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Проверяет наличие обновлений адресного классификатора на веб сервере
// для тех объектов, которые ранее уже загружались.
//
// Возвращаемое значение - Массив - Содержит структуры с полями:
//     * КодАдресногоОбъекта - Строка - Код адресного объекта
//     * Наименование        - Строка - Наименование адресного объекта
//     * Сокращение          - Строка - Сокращение адресного объекта
//     * Индекс              - Строка - Индекс адресного объекта
//     * ОбновлениеДоступно  - Булево
//
Функция ПроверитьОбновлениеАдресныхОбъектовСервер() Экспорт
	
	Возврат АдресныйКлассификаторКлиентСервер.ПроверитьОбновлениеАдресныхОбъектов();
	
КонецФункции

// Возвращает версию адресных объектов, записанную при последнем обновлении
// Если записи об адресном объекте нет - возвращается дата 01.09.2008
// 
// Возвращаемое значение:
//     Массив - Содержит соответствия, где ключ - номер адресного объекта, значение - дата выпуска версии
//
Функция ВерсииАдресныхОбъектов() Экспорт
	
	Возврат АдресныйКлассификатор.ВерсииАдресныхОбъектов();
	
КонецФункции

// Возвращает структуру, содержащую информацию по адресному объекту
// 
// Параметры:
//     КодАдресногоОбъекта - Строка - Номер адресного объекта от 1 до 89 + 99 в формате NN
//
// Возвращаемое значение:
//     Структура - Описание адресного объекта с полями:
//         * КодАдресногоОбъекта - Строка - Код адресного объекта.
//         * Наименование        - Строка - Наименование адресного объекта.
//         * Сокращение          - Строка - Сокращение адресного объекта.
//         * Индекс              - Строка - Индекс.
//
Функция ИнформацияПоАдресномуОбъекту(КодАдресногоОбъекта) Экспорт
	
	Возврат АдресныйКлассификатор.ИнформацияПоАдресномуОбъекту(КодАдресногоОбъекта);
	
КонецФункции

// Считывает с диска файл версий адресных объектов и возвращает
// версии сведений по адресным объектам
//
// Параметры:
//     ТекстXML - Строка - Строка, содержащая текст XML.
//
// Возвращаемое значение:
//    Соответствие - Описание файла версий: Ключ - Строка - адресный объект, Значение - Дата - дата актуальности адресного объекта.
//
Функция ПолучитьВерсииАдресныхСведений(ТекстXML) Экспорт
	
	Возврат АдресныйКлассификатор.ПолучитьВерсииАдресныхСведений(ТекстXML);
	
КонецФункции

// Данные для запроса разрешений профилей безопасности для проверки наличия обновления КЛАДР на сайте 1С
//
// Возвращаемое значение:
//     Массив - идентификаторы необходимых разрешений
// 
Функция ЗапросРазрешенийБезопасностиПроверкиОбновленияКЛАДР() Экспорт
	
	ВладелецРазрешения = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("РегистрСведений.АдресныйКлассификатор"); 
	Разрешения         = АдресныйКлассификатор.РазрешенияБезопасностиПроверкиОбновления();
	
	Результат = Новый Массив;
	Результат.Добавить(
		РаботаВБезопасномРежиме.ЗапросНаИспользованиеВнешнихРесурсов(Разрешения, ВладелецРазрешения, Истина)
	);
	
	Возврат Результат;
КонецФункции

// Возвращает флаг разрешения загрузки или очистки адресного классификатора
//
Функция МожноИзменятьАдресныйКлассификатор() Экспорт
	
	Возврат Не ОбщегоНазначенияПовтИсп.РазделениеВключено();
	
КонецФункции

#КонецОбласти
