#Область УправлениеФормой
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИмя
#КонецОбласти

#Область ОбработчикиСобытийФормы
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСписокЦветов(Команда)
	ОбновитьСписокЦветовНаСервере();
	
	Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ОбновитьСписокЦветовНаСервере()
	Справочники.ЦветоваяГаммаПланировщика.ОбновитьСписокЦветовСправочника();
КонецПроцедуры

#КонецОбласти
