#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ФункцииОтчетовКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	Настройки.События.ПриОпределенииПараметровВыбора = Истина;
	Настройки.ПараметрыПечатиПоУмолчанию.ПолеСверху = 5;
	Настройки.ПараметрыПечатиПоУмолчанию.ПолеСлева = 5;
	Настройки.ПараметрыПечатиПоУмолчанию.ПолеСнизу = 5;
	Настройки.ПараметрыПечатиПоУмолчанию.ПолеСправа = 5;
	Настройки.ФормироватьСразу = Истина;
КонецПроцедуры

// Вызывается в форме отчета перед выводом настройки.
//   Подробнее - см. ФормаОтчетаПереопределяемый.ПриОпределенииПараметровВыбора()
//
Процедура ПриОпределенииПараметровВыбора(Форма, СвойстваНастройки) Экспорт
	Если СвойстваНастройки.Шаблон = "СписокСПодбором" Тогда // Вместо списка с флажками и командной панелью...
		СвойстваНастройки.Шаблон = "СвязьСКомпоновщиком"; //... выводится поле ввода, связанное с СКД.
	КонецЕсли;
	
	Если СвойстваНастройки.ОписаниеТипов.СодержитТип(Тип("СправочникСсылка.Пользователи")) Тогда
		СвойстваНастройки.ОграничиватьВыборУказаннымиЗначениями = Истина;
		СвойстваНастройки.ЗначенияДляВыбора.Очистить();
		СвойстваНастройки.ЗапросЗначенийВыбора.Текст =
			"Выбрать Ссылка Из Справочник.Пользователи
			|Где Не ПометкаУдаления И Не Недействителен И Не Служебный";
	КонецЕсли;
КонецПроцедуры

#КонецЕсли
