#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	СтандартнаяОбработка = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Версии = ПолучитьВерсииWebСервиса();
	
	Если Версии.Найти("1.0.2.1") <> Неопределено Тогда
	
		ВыбраннаяФорма = "НастройкаСИнтервалами";
			
		ОбластьДанных = ОбщегоНазначения.ЗначениеРазделителяСеанса();
		
		ДополнительныеПараметры = РезервноеКопированиеОбластейДанныхДанныеФормИнтерфейс.
			ПолучитьПараметрыФормыНастроек(ОбластьДанных);
		Для каждого КлючИЗначение Из ДополнительныеПараметры Цикл
			Параметры.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
		
	ИначеЕсли РезервноеКопированиеОбластейДанныхПовтИсп.МенеджерСервисаПоддерживаетРезервноеКопирование() Тогда
		
		ВыбраннаяФорма = "НастройкаБезИнтервалов";
		
	Иначе
#КонецЕсли
		
		ВызватьИсключение(НСтр("ru = 'Менеджер сервиса не поддерживает резервное копирование приложений'"));
		
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	КонецЕсли;
#КонецЕсли
	
КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Функция ПолучитьВерсииWebСервиса()
	
	Возврат ОбщегоНазначения.ПолучитьВерсииИнтерфейса(
		Константы.ВнутреннийАдресМенеджераСервиса.Получить(),
		Константы.ИмяСлужебногоПользователяМенеджераСервиса.Получить(),
		Константы.ПарольСлужебногоПользователяМенеджераСервиса.Получить(),
		"ZoneBackupControl");

КонецФункции
#КонецЕсли

#КонецОбласти
