#Область ПрограммныйИнтерфейс
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//УзелСсылка = ИнтеграцияСGoogle.ПолучитьУзелОбменаПользователя(ЭтотОбъект.Владелец);
	//ПланыОбмена.ЗарегистрироватьИзменения(УзелСсылка, ЭтотОбъект.Ссылка);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИспользоватьПрефикс 	= Истина;
	Общественный			= Ложь;
	СинхронизацияСGoogle	= Ложь;
	Префикс					= "";
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти
