
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Демо: Стандартные подсистемы"
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

//////////////////////////////////////////////////////////////////////////////
// Обработчики событий подписок для документов "_Демо"

Процедура _ДемоЗаполнитьДатуДокументаПоРабочейДатеОбработкаЗаполнения(Источник, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	Источник.Дата = ОбщегоНазначения.ТекущаяДатаПользователя();

КонецПроцедуры

Процедура _ДемоЗаполнитьДатуДокументаПоРабочейДатеПриКопировании(Источник, ОбъектКопирования) Экспорт
	
	Источник.Дата = ОбщегоНазначения.ТекущаяДатаПользователя();

КонецПроцедуры

#КонецОбласти
