#Область ПрограммныйИнтерфейс

// Общие методы
Функция ПустойИдентификатор() Экспорт
	Возврат Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
КонецФункции

// Время в секундах
Функция МесяцВСекундах(ЧислоДней = 30) Экспорт
	Возврат ЧислоДней * ДеньВСекундах();
КонецФункции

Функция НеделяВСекундах() Экспорт
	Возврат 7 * ДеньВСекундах();
КонецФункции

Функция ДеньВСекундах() Экспорт
	Возврат 24 * ЧасВСекундах();
КонецФункции

Функция ЧасВСекундах() Экспорт 
	Возврат 3600;
КонецФункции

// Выполняет округление времени до 15 минут
//
// Параметры:
//	ЗначениеВремени - Тип: ДатаВремя
//
// Возвращаемое значение:
//	ДатаВремя
//
Функция ОкруглитьВыбранноеВремя(Знач ЗначениеВремени) Экспорт
	ЗначениеВремени = НачалоМинуты(ЗначениеВремени);
	Возврат НачалоЧаса(ЗначениеВремени) + Окр(Минута(ЗначениеВремени) / 15) * 900;
КонецФункции

// Преобразование цветов
Функция ЦветВHex(Красный, Зеленый, Синий) Экспорт
	_12 = DecToHex(Красный);
	_34 = DecToHex(Зеленый);
	_56 = DecToHex(Синий);
	
	Возврат "#" + _12 + _34 + _56;
КонецФункции

Функция HexВЦвет(Значение) Экспорт
	ЗначениеHex		= Сред(Значение, 2);
	Красный	= HexToDec(Сред(ЗначениеHex, 0 , 2));
	Зеленый	= HexToDec(Сред(ЗначениеHex, 3 , 2));
	Синий	= HexToDec(Сред(ЗначениеHex, 5 , 2));
	
	Возврат Новый Цвет(Красный, Зеленый, Синий);
КонецФункции

// Общие методы
Процедура УстановитьЗаголовокГруппы(Форма, НазваниеГруппы, ЗаголовокТекст) Экспорт
	
	#Если ВебКлиент Тогда
		Форма.Элементы[НазваниеГруппы].СвернутыйЗаголовок = ЗаголовокТекст;
	#Иначе
		Форма.Элементы[НазваниеГруппы].ЗаголовокСвернутогоОтображения = ЗаголовокТекст;
	#КонецЕсли
	
КонецПроцедуры

// Представление периода
Функция ПредставлениеДняНедели(НомерДняНедели) Экспорт
	
	СтрПериод = "";
	
	Если НомерДняНедели = 1 Тогда
		СтрПериод = СтрПериод + "пн";
	ИначеЕсли НомерДняНедели = 2 Тогда
		СтрПериод = СтрПериод + "вт";
	ИначеЕсли НомерДняНедели = 3 Тогда
		СтрПериод = СтрПериод + "ср";
	ИначеЕсли НомерДняНедели = 4 Тогда
		СтрПериод = СтрПериод + "чт";
	ИначеЕсли НомерДняНедели = 5 Тогда
		СтрПериод = СтрПериод + "пт";
	ИначеЕсли НомерДняНедели = 6 Тогда
		СтрПериод = СтрПериод + "сб";
	ИначеЕсли НомерДняНедели = 7 Тогда
		СтрПериод = СтрПериод + "вс";
	КонецЕсли;
	
	Возврат СтрПериод;
	
КонецФункции

Функция ПредставлениеМесяца(НомерМесяца) Экспорт
	
	СтрПериод = "";
	
	Если НомерМесяца = 1 Тогда
		СтрПериод = СтрПериод + "янв";
	ИначеЕсли НомерМесяца = 2 Тогда
		СтрПериод = СтрПериод + "фев";
	ИначеЕсли НомерМесяца = 3 Тогда
		СтрПериод = СтрПериод + "мар";
	ИначеЕсли НомерМесяца = 4 Тогда
		СтрПериод = СтрПериод + "апр";
	ИначеЕсли НомерМесяца = 5 Тогда
		СтрПериод = СтрПериод + "май";
	ИначеЕсли НомерМесяца = 6 Тогда
		СтрПериод = СтрПериод + "июн";
	ИначеЕсли НомерМесяца = 7 Тогда
		СтрПериод = СтрПериод + "июл";
	ИначеЕсли НомерМесяца = 8 Тогда
		СтрПериод = СтрПериод + "авг";
	ИначеЕсли НомерМесяца = 9 Тогда
		СтрПериод = СтрПериод + "сен";
	ИначеЕсли НомерМесяца = 10 Тогда
		СтрПериод = СтрПериод + "окт";
	ИначеЕсли НомерМесяца = 11 Тогда
		СтрПериод = СтрПериод + "нояб";
	ИначеЕсли НомерМесяца = 12 Тогда
		СтрПериод = СтрПериод + "дек";
	КонецЕсли;
	
	Возврат СтрПериод; 
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Преобразование значений
Функция Из_10_В_Любой(знач Значение, Нотация)
	Если Нотация <= 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Значение = Число(Значение);
	
	Если Значение <= 0 Тогда
		Возврат "0";
	КонецЕсли;
	
	Значение = Цел(Значение);
	Результат = "";
	
	Пока Значение > 0 Цикл
		Результат	= Сред("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ", Значение % Нотация + 1, 1) + Результат;
		Значение	= Цел(Значение/Нотация);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция Из_Любой_В_10(знач Значение, Нотация)
	Если Нотация <= 0  Тогда
		Возврат 0;
	КонецЕсли;
	
	Значение = Врег(СокрЛП(Значение));
	
	Если Значение = "0" Тогда
		Возврат 0;
	КонецЕсли;
	
	Результат	= 0;
	Длина		= СтрДлина(Значение);
	Для Х = 1 По Длина Цикл
		М = 1;
		
		Для У = 1 По Длина - Х Цикл
			М = М * Нотация
		КонецЦикла;
		
		Результат = Результат + (Найти("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ", Сред(Значение,Х,1)) - 1) * М;
	КонецЦикла;
	
	Возврат Окр(Результат);
КонецФункции

Функция DecToHex(знач Значение)
	Возврат Из_10_В_Любой(Значение, 16); 
КонецФункции

Функция HexToDec(знач Значение)
	Возврат Из_Любой_В_10(Значение, 16);
КонецФункции

#КонецОбласти


