////////////////////////////////////////////////////////////////////////////////
// Подсистема "Информация при запуске"
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определение настроек отображения информации при запуске.
//
// Параметры:
//   Настройки - Коллекция настроек подсистемы. Реквизиты:
//       * Показывать - Булево - Показывать ли информацию в текущем сеансе.
//           - Истина - Информация будет показана после входа в программу.
//           - Ложь - Информация не будет показана.
//
Процедура ОпределитьНастройки(Настройки) Экспорт
	
	// _Демо начало примера
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		Настройки.Показывать = Ложь;
	КонецЕсли;
	// _Демо конец примера
	
КонецПроцедуры

#КонецОбласти
