
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	КаталогДляСохраненияДанныхПечати = УправлениеПечатью.ПолучитьЛокальныйКаталогФайловПечати();
	Элементы.Сообщение.Заголовок = Элементы.Сообщение.Заголовок + Символы.ПС + Параметры.СообщениеОбОшибке;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВРег(ИсточникВыбора.ИмяФормы) = ВРег("РегистрСведений.ПользовательскиеМакетыПечати.Форма.НастройкаКаталогаФайловПечати") Тогда
		
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
			КаталогДляСохраненияДанныхПечати = ВыбранноеЗначение;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьРабочийКаталогПечати(Команда)
	
	ОткрытьФорму("РегистрСведений.ПользовательскиеМакетыПечати.Форма.НастройкаКаталогаФайловПечати", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПовторитьПечать(Команда)
	Закрыть(КаталогДляСохраненияДанныхПечати);
КонецПроцедуры

#КонецОбласти
