
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НачалоДня(Параметры.ОкончаниеСобытия) = НачалоДня(Параметры.ОкончаниеПовторений) Тогда
		Элементы.ГруппаПоследующиеСобытия.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВсеСобытия(Команда)
	ЭтотОбъект.Закрыть(1);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьТекущееСобытие(Команда)
	ЭтотОбъект.Закрыть(2);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПоследующиеСобытия(Команда)
	ЭтотОбъект.Закрыть(3);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	ЭтотОбъект.Закрыть(0);
КонецПроцедуры
