
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//ОткрытьФорму("Обработка.ИнструментыРазработчикаКонвертацияОбращенийККлючевымОперациям.Форма", , ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	ОткрытьФорму(
		"Обработка.ИнструментыРазработчикаКонвертацияОбращенийККлючевымОперациям.Форма",
		Новый Структура,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность);
	
КонецПроцедуры
