
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Взаимодействия"
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// В данной функции при необходимости формируется массив строковых представлений предметов взаимодействий
// Используется, если в конфигурации определен хотя бы один предмет взаимодействий.
//
// Возвращаемое значение:
//   Булево   - массив строковых представлений возможных предметов взаимодействий.
//
Функция ПолучитьМассивТиповПредметов() Экспорт
	
	 МассивТиповПредметов = Новый Массив;
	
	// _Демо начало примера
	МассивТиповПредметов.Добавить("ДокументСсылка._ДемоЗаказПокупателя");
	// _Демо конец примера

	Возврат МассивТиповПредметов;
	
КонецФункции

// Дополняет описания возможных типов контактов.
// Используется, если в конфигурации определен хотя бы один тип контактов взаимодействий,
// помимо справочника Пользователи.
//
// Возвращаемые :
//   Массив  - массив структур, в котором описываются возможные типы контактов.
//              Каждая структура содержит описание одного типа контактов.   
//              Описание полей структуры см. в комментарии к функции
//              ДобавитьЭлементМассиваОписанияВозможныхТиповКонтактов общего модуля
//              ВзаимодействияКлиентСервер.
//
Процедура ДополнитьМассивОписанияВозможныхКонтактов(МассивВозможныеКонтакты) Экспорт

	// _Демо начало примера
	ВзаимодействияКлиентСервер.ДобавитьЭлементМассиваОписанияВозможныхТиповКонтактов(МассивВозможныеКонтакты,
		Тип("СправочникСсылка._ДемоПартнеры"),Истина,"_ДемоПартнеры",НСтр("ru = 'Демо: Партнеры'"),Истина,Ложь,"",Истина,"");
	ВзаимодействияКлиентСервер.ДобавитьЭлементМассиваОписанияВозможныхТиповКонтактов(МассивВозможныеКонтакты,
		Тип("СправочникСсылка._ДемоКонтактныеЛицаПартнеров"),Истина,"_ДемоКонтактныеЛицаПартнеров",
		НСтр("ru = 'Демо: Контактные лица партнеров'"),Ложь,Истина,"_ДемоПартнеры",Истина,"");
	// _Демо конец примера

КонецПроцедуры

#КонецОбласти
