////////////////////////////////////////////////////////////////////////////////
// Подсистема "Базовая функциональность".
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет список модулей библиотек и конфигурации, которые
// предоставляют основные сведения о себе: имя, версия, список обработчиков обновления
// а также зависимости от других библиотек.
//
// Состав обязательных процедур модуля см. в разделе
// "ПРОГРАММНЫЙ ИНТЕРФЕЙС" общего модуля ОбновлениеИнформационнойБазыБСП.
//
// Параметры:
//  МодулиПодсистем - Массив - имена серверных общих модулей библиотек и основной конфигурации.
//                             Например: ОбновлениеИнформационнойБазыБСП.
//                    
// Примечание: модуль Библиотеки стандартных подсистем ОбновлениеИнформационнойБазыБСП 
// не требуется явно добавлять в массив МодулиПодсистем.
//
Процедура ПриДобавленииПодсистем(МодулиПодсистем) Экспорт
	
	// _Демо начало примера
	МодулиПодсистем.Добавить("_ДемоОбновлениеИнформационнойБазыБСП");
	// _Демо конец примера
	
	// _Планировщик начало примера
	МодулиПодсистем.Добавить("ПланировщикДанные");
	// _Планировщик конец примера
	
КонецПроцедуры

#КонецОбласти
