
&НаКлиенте
Процедура Выбрать(Команда)
	
	ОтборМетаданных = Неопределено;
	
	Если ТолькоСправочникиИДокументы Тогда
		ОтборМетаданных = Новый СписокЗначений;
		ОтборМетаданных.Добавить("Справочники");
		ОтборМетаданных.Добавить("Документы");
	КонецЕсли;
		
	Результат = ОткрытьФорму("ОбщаяФорма.ВыборОбъектовМетаданных", 
	                  Новый Структура("КоллекцииВыбираемыхОбъектовМетаданных,
	                                  |ВыбранныеОбъектыМетаданных,
	                                  |УникальныйИдентификаторИсточник",
	                                  ОтборМетаданных,
	                                  Объект.ОбъектыМетаданных,
	                                  УникальныйИдентификатор));
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыборОбъектовМетаданных" И Источник = УникальныйИдентификатор Тогда
		Объект.ОбъектыМетаданных.ЗагрузитьЗначения(Параметр.ВыгрузитьЗначения());
	КонецЕсли;
	
КонецПроцедуры

